{
    "listOfEvents": [
        {
            "id": 2.1,
            "name": "Abertura oficial",
            "subTitle": "subtitle",
            "image": "../../eventsImages/onovolab.png",
            "imageDesc": "OnovoLab",
            "author": "ONOVOLAB",
            "date": "02 de setembro",
            "time": "19:00 às 21:00",
            "link": "https://www.sympla.com.br/abertura-da-iv-semana-da-computacao-wecomp-do-ifsp-sao-carlos__2114909",
            "active": false,
            "status": "EM BREVE!",
            "location": "ONOVOLAB",
            "description": "A abertura oficial da V Wecomp acontecerá no ONOVOLAB e contará com a presença de empresas parceiras, uma mesa redonda e uma confraternização. Não perca!"
        },
        {
            "id": 2.2,
            "name": "Como sobreviver no terminal do Linux (Turma I)",
            "subTitle": "",
            "image": "../../eventsImages/carlao.jpeg",
            "imageDesc": "Professor Carlão",
            "bio": "É professor efetivo do IFSP (campus São Carlos), desde 2012. Possui doutorado em Geografia pela UNESP, no qual desenvolveu um software para produção e análise de informações geográficas com o auxílio de técnicas de computação inteligente (lógica Nebulosa e redes neurais artificiais). É mestre pela Escola Nacional de Ciências Estatísticas e Tecnólogo em Processamento de Dados pela Universidade Veiga de Almeida. Usuário de Linux desde 2005, colaborador e disseminador da filosofia do Software Livre. Vascaíno sofredor.",
            "author": "Carlão Pereira",
            "date": "02 de setembro",
            "time": "8:30 às 11:30",
            "link": "https://forms.gle/7BMKazi7Q4d9GPQy6",
            "active": false,
            "vacancies": 30,
            "status": "EM BREVE!",
            "location": "IFSP",
            "classification": "Livre",
            "description": "Este mini-curso apresentará uma breve história da filosofia do Software Livre e do surgimento do sistema operacional Linux, focando em seguida nos principais comandos para dominar o terminal e executar tarefas com agilidade e eficiência. Desde comandos básicos de navegação até operações mais avançadas, serão exploradas ferramentas essenciais para gestão de arquivos, instalação de programas, gerenciamento de processos, entre outros, de uma forma totalmente prática."
        },
        {
            "id": 3.1,
            "name": "Introdução ao Desenvolvimento de Modelos de Aprendizado de Máquina Produtivos",
            "subTitle": "",
            "image": "../../eventsImages/MoacirPonti.jpg",
            "imageDesc": "Xmobots",
            "bio": "Professor associado e pesquisador nas áreas de aprendizado de máquina, visão computacional e processamento de fala, atuando no ICMC da Universidade de São Paulo há 14 anos. Desde 2022, é também Cientista de Dados Expert na equipe da América Latina de prevenção à fraude em marketplace no Mercado Livre, aplicando algoritmos de aprendizado de máquina em bases de dados reais.",
            "author": "Moacir Ponti",
            "date": "03 de setembro",
            "time": "08:00 às 12:00",
            "link": "https://forms.gle/DLzmDh1j7UDSu7f28",
            "active": false,
            "vacancies": 30,
            "status": "EM BREVE!",
            "location": "IFSP",
            "classification": "Intermediário",
            "description": "Este mini-curso abordará as etapas do desenvolvimento de um modelo de aprendizado de máquina produtivo. Utilizaremos um caso de uso de moderação de itens em uma plataforma de e-commerce. Com orientação a objetos em Python, será feita uma introdução às etapas da criação de software responsável por (1) obtenção e tratamento de dados, (2) escolha e treinamento de um modelo supervisionado, (3) tratamento de requisições e inferência."
        },
        {
            "id": 3.3,
            "name": "Desenvolvimento Moderno com React e Redux",
            "subTitle": "Da Introdução ao Gerenciamento de Estado Avançado",
            "image": "../../eventsImages/DiegoVeiga.jpeg",
            "imageDesc": "Xmobots",
            "bio": "Diego Veiga Santos é desenvolvedor Desenvolvedor P&D Pleno na XMobots, onde trabalha há quatro anos.",
            "author": "Diego Veiga Santos",
            "date": "03 de setembro",
            "time": "08:30 às 11:30",
            "link": "https://forms.gle/DLzmDh1j7UDSu7f28",
            "active": false,
            "vacancies": 30,
            "status": "EM BREVE!",
            "location": "IFSP",
            "classification": "Básico",
            "description": "Este curso abrange o desenvolvimento com React e Redux. Começamos com os fundamentos do React: componentes, JSX, state e props. Vamos explorar o gerenciamento de estado local com useState e useEffect. Em seguida, iremos abordar o Redux, incluindo conceitos básicos, principais erros na utilização, boas práticas, Redux Toolkit, slices, RTK Query, e a integração com React. Iremos finalizar com um exemplo prático de lista de tarefas, conectando componentes ao store e utilizando Redux DevTools para debugging."
        },
        {
            "id": 3.2,
            "name": "Dominando o Fluxo: Git e Git Flow Descomplicados",
            "subTitle": "",
            "image": "../../eventsImages/MarcoPereira.jpeg",
            "imageDesc": "Xmobots",
            "bio": "Marco Guilherme Pereira é Cientista da Computação e Desenvolvedor P&D na XMobots desde 2021.",
            "author": "Marco Guilherme Pereira",
            "date": "03 de setembro",
            "time": "14:00 às 17:00",
            "link": "https://forms.gle/DLzmDh1j7UDSu7f28",
            "active": false,
            "vacancies": 40,
            "status": "EM BREVE!",
            "location": "IFSP",
            "classification": "Básico",
            "description": "Você aprenderá a dominar o Git Flow, um fluxo de trabalho eficiente para gerenciar projetos de software. Começando com uma revisão rápida dos conceitos básicos do Git, você será guiado por cada etapa do Git Flow, desde a criação de features até o lançamento de versões e correção de bugs. Além disso, exploraremos como integrar o Git Flow com pipelines de CI/CD para automatizar e otimizar o ciclo de desenvolvimento, garantindo entregas mais rápidas e de alta qualidade."
        },
        {
            "id": 3.3,
            "name": "Palestra Xmobots",
            "subTitle": "Engenharia de software na prática",
            "image": "../../eventsImages/Xmobots.png",
            "imageDesc": "Xmobots",
            "bio": "Emerson R. de Toledo é um xecutivo com sólida carreira na área de Tecnologia, com foco em Pesquisa & Desenvolvimento (P&D). Tem ocupado cargos de gestão estratégica nos últimos 19 anos em grandes multinacionais do segmento de telecomunicações, P&D, tecnologia da informação e automotivo.",
            "author": "Emerson R. de Toledo",
            "date": "03 de setembro",
            "time": "19:00 às 20:40",
            "link": "https://forms.gle/DLzmDh1j7UDSu7f28",
            "active": false,
            "vacancies": 220,
            "status": "EM BREVE!",
            "location": "IFSP",
            "classification": "Livre",
            "description": "Nesta palestra será oferecida uma visão geral da Xmobots e como aplicamos a Engenharia de Software na prática."
        },
        {
            "id": 3.3,
            "name": "Palestra Compass UOL",
            "subTitle": "Talk da Compass UOL",
            "image": "../../eventsImages/talkCompassUOL.png",
            "imageDesc": "Compass UOL",
            "bio": "",
            "author": "Equipe Compass UOL",
            "date": "03 de setembro",
            "time": "21:00 às 22:30",
            "link": "https://forms.gle/DLzmDh1j7UDSu7f28",
            "active": false,
            "vacancies": 110,
            "status": "EM BREVE!",
            "location": "IFSP",
            "classification": "Livre",
            "description": "Palestra da Compass UOL."
        },
        {
            "id": 28.3,
            "name": "Palestra Marlabs",
            "subTitle": "Inovação Colaborativa: Estratégias para Encantar clientes com qualidade e trabalho em equipe",
            "image": "../../eventsImages/talkMarlabs.png",
            "imageDesc": "Marlabs",
            "bio": "Fabíola Cardes é uma profissional com 15 anos de experiência em recursos humanos (RH). Atualmente, é Head Pessoas e Cultura da Marlabs Brasil. Elekmilton iniciou na Marlabs em 2016, trilhou carreira em QA, Liderança de Desenvolvimento e desde 2022 atua como Delivery Manager. Engenheiro da Computação pela UFSCar (2016), Especialista em Engenharia de Software pelo SENAC( 2019), Especialista em Administração de Empresas pela ESALQ/USP(2022), Especialista em Inteligência de Negócio pela Anhembi (2023) e cursando Especialização em Inteligência Artificial pela UNOPAR.",
            "author": "Fabíola Cardes e Elekmilton Cardoso",
            "date": "04 de setembro",
            "time": "19:00 às 21:00",
            "link": "https://forms.gle/f3bwWbb9V6aAJvnz6",
            "active": false,
            "vacancies": 110,
            "status": "EM BREVE!",
            "location": "IFSP",
            "classification": "Livre",
            "description": "Neste encontro, vamos explorar como a inovação colaborativa pode ser a chave para encantar clientes e entregar soluções de alta qualidade. Através de estratégias práticas, discutiremos como equipes multidisciplinares podem trabalhar juntas de forma eficaz para criar produtos e serviços que não só atendam, mas superem as expectativas dos clientes. Esta palestra é ideal para profissionais e estudantes que desejam aprimorar suas habilidades em trabalho em equipe e inovação, impulsionando suas carreiras e impactando positivamente o mercado."
        },
        {
            "id": 29.1,
            "name": "Git e GitHub: do mínimo que você precisa saber ao deploy no Vercel",
            "subTitle": "Além do hype: criando uma empresa de tecnologia do zero",
            "image": "../../eventsImages/Lucas.jpeg",
            "imageDesc": "Softable",
            "bio": "Lucas é um cientista da computação que se diverte projetando e desenvolvendo software há 20 anos. É professor do IFSP São Carlos desde 2015 e atual tutor do PET/ADS. Fhelippe, Hugo e Eduardo Derisso são alunos do curso de ADS do IFSP e bolsistas do grupo PET/ADS. ",
            "author": "Lucas Oliveira",
            "date": "05 de setembro",
            "time": "08:30 às 11:30",
            "link": "https://forms.gle/7BMKazi7Q4d9GPQy6",
            "active": false,
            "vacancies": 40,
            "status": "EM BREVE!",
            "location": "IFSP",
            "classification": "Livre",
            "description": "Neste minicurso, você aprenderá os conceitos básicos do Git, capacitando-o a usar essa ferramenta no dia a dia. Também será apresentada uma visão geral do GitHub e como integrá-lo ao Vercel para realizar deploys automáticos de páginas web."
        },
        {
            "id": 29.1,
            "name": "Palestra Softable",
            "subTitle": "Além do hype: criando uma empresa de tecnologia do zero",
            "image": "../../eventsImages/Softable.png",
            "imageDesc": "Softable",
            "bio": "Há 7 anos, numa sala de apartamento, ainda na faculdade, George Tamanaka e Gustavo Kobayashi criaram a Softable, que tem a missão de devolver às empresas o controle sobre seus processos, oferecendo aos clientes soluções simples, acessíveis e transparentes que resolvem problemas reais.",
            "author": "George tamanaka e Gustavo Kobayashi",
            "date": "05 de setembro",
            "time": "19:00 às 21:00",
            "link": "https://forms.gle/7BMKazi7Q4d9GPQy6",
            "active": false,
            "vacancies": 110,
            "status": "EM BREVE!",
            "location": "IFSP",
            "classification": "Livre",
            "description": "Queremos te contar o que ninguém contou sobre empreender ainda na faculdade. Quais foram os desafios e aprendizados até a Softable se tornar parceira de tecnologia de algumas das maiores marcas do mundo."
        },
        {
            "id": 6.1,
            "name": "Como sobreviver no terminal do Linux (Turma II)",
            "subTitle": "",
            "image": "../../eventsImages/carlao.jpeg",
            "imageDesc": "Professor Carlão",
            "bio": "É professor efetivo do IFSP (campus São Carlos), desde 2012. Possui doutorado em Geografia pela UNESP, no qual desenvolveu um software para produção e análise de informações geográficas com o auxílio de técnicas de computação inteligente (lógica Nebulosa e redes neurais artificiais). É mestre pela Escola Nacional de Ciências Estatísticas e Tecnólogo em Processamento de Dados pela Universidade Veiga de Almeida. Usuário de Linux desde 2005, colaborador e disseminador da filosofia do Software Livre. Vascaíno sofredor.",
            "author": "Carlão Pereira",
            "date": "06 de setembro",
            "time": "8:30 às 11:30",
            "link": "https://forms.gle/7BMKazi7Q4d9GPQy6",
            "active": false,
            "vacancies": 30,
            "status": "EM BREVE!",
            "location": "IFSP",
            "classification": "Livre",
            "description": "Este mini-curso apresentará uma breve história da filosofia do Software Livre e do surgimento do sistema operacional Linux, focando em seguida nos principais comandos para dominar o terminal e executar tarefas com agilidade e eficiência. Desde comandos básicos de navegação até operações mais avançadas, serão exploradas ferramentas essenciais para gestão de arquivos, instalação de programas, gerenciamento de processos, entre outros, de uma forma totalmente prática."
        },
        {
            "id": 6.2,
            "name": "Robôs de Automação de processo",
            "subTitle": "foque no que importa, automatize tarefas repetitivas e tenha resultados incríveis",
            "image": "../../eventsImages/FabioOliveira.jpeg",
            "imageDesc": "Fábio Oliveira",
            "bio": "Fábio é um Tech Lead apaixonado por desenvolvimento de software e inovação tecnológica, com sólida formação em Computação e experiência em liderança de equipes. Especialista em Java, Spring, REST APIs, Kafka, e metodologias ágeis, atualmente, lidera iniciativas de RPA e hyperautomation, impulsionando a transformação digital e a eficiência operacional.",
            "author": "Fabio Oliveira",
            "date": "06 de setembro",
            "time": "14:00 às 17:00",
            "link": "https://forms.gle/7BMKazi7Q4d9GPQy6",
            "active": false,
            "vacancies": 40,
            "status": "EM BREVE!",
            "location": "IFSP",
            "classification": "Básico",
            "description": "Prepare-se para uma imersão prática no universo da automação com RPA! Nesse mini curso você descobrirá como a poderosa ferramenta Automation Edge pode transformar tarefas repetitivas em processos automatizados, revolucionando a eficiência operacional. Durante o curso, você não só aprenderá os fundamentos do RPA, mas também colocará a mão na massa, construindo seu próprio robô para ver a automação em ação. Entre de cabeça no futuro da tecnologia!"
        },
        {
            "id": 10.1,
            "name": "Palestra F1RST",
            "subTitle": "Talk da F1RST",
            "image": "../../eventsImages/talkF1rst.png",
            "imageDesc": "F1rst",
            "bio": "A F1rst promove serviços e experiências para os mais de 60 milhões de clientes de todo ecossistema Santander Brasil, Coligadas e Grupo Santander na América do Sul.",
            "author": "Equipe F1rst",
            "date": "06 de setembro",
            "time": "19:00",
            "link": "https://forms.gle/7BMKazi7Q4d9GPQy6",
            "active": false,
            "vacancies": 110,
            "status": "EM BREVE!",
            "location": "IFSP",
            "classification": "Básico",
            "description": "Palestra da equipe F1RST"
        }
    ]
}